РП/src/Catalogs/ПравилаРаспределенияРасходов/ПравилаРаспределенияРасходов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПравилаРаспределенияРасходов</name>
  <attributes>
    <name>НазначениеПравила</name>
    <type>
      <types>EnumRef.НазначениеПравилРаспределенияРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>БазаРаспределения</name>
    <type>
      <types>EnumRef.ТипыБазыРаспределенияРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяКалькуляции</name>
    <type>
      <types>CatalogRef.СтатьиКалькуляции</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеРаспределения</name>
    <type>
      <types>EnumRef.СпособыРаспределенияСтатейРасходов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтборПоГруппамПродукции</name>
    <attributes>
      <name>ГруппаПродукции</name>
      <type>
        <types>CatalogRef.ГруппыАналитическогоУчетаНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОтборПоМатериалам</name>
    <attributes>
      <name>Материал</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОтборПоВидамРабот</name>
    <attributes>
      <name>ВидРабот</name>
      <type>
        <types>CatalogRef.ВидыРаботСотрудников</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОтборПоПодразделениям</name>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.СтруктураПредприятия</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

РП/src/InformationRegisters/ЗначенияПоказателейДляРаспределенияРасходов/ЗначенияПоказателейДляРаспределенияРасходов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗначенияПоказателейДляРаспределенияРасходов</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>ЗначениеПоказателя</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Показатель</name>
    <type>
      <types>CatalogRef.ПравилаРаспределенияРасходов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

РП/src/Enums/ТипыБазыРаспределенияРасходов/ТипыБазыРаспределенияРасходов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыБазыРаспределенияРасходов</name>
  <enumValues>
    <name>СуммаРасходовНаОплатуТруда</name>
  </enumValues>
  <enumValues>
    <name>СуммаМатериальныхЗатрат</name>
  </enumValues>
  <enumValues>
    <name>ВводитсяПриИзменении</name>
  </enumValues>
  <enumValues>
    <name>ВводитсяЕжемесячно</name>
  </enumValues>
  <enumValues>
    <name>КоличествоПродукции</name>
  </enumValues>
  <enumValues>
    <name>ВесПродукции</name>
  </enumValues>
  <enumValues>
    <name>ОбъемПродукции</name>
  </enumValues>
  <enumValues>
    <name>НормативРасходаМатериала</name>
  </enumValues>
  <enumValues>
    <name>КоличествоРаботУказанныхВидов</name>
  </enumValues>
  <enumValues>
    <name>КоличествоУказанныхМатериалов</name>
  </enumValues>
  <enumValues>
    <name>ОбъемУказанныхМатериалов</name>
  </enumValues>
  <enumValues>
    <name>ВесУказанныхМатериалов</name>
  </enumValues>
  <enumValues>
    <name>ПлановаяСтоимостьПродукции</name>
  </enumValues>
  <enumValues>
    <name>НормативыОплатыТруда</name>
  </enumValues>
</mdclass:Enum>

РП/src/Catalogs/ПравилаРаспределенияРасходов/Forms/ФормаСпискаВручную/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Если Параметры.Свойство("Период") Тогда
		Период = Параметры.Период;
	Иначе
		Период = НачалоМесяца(ТекущаяДата());
	КонецЕсли;
	
	Если Параметры.Свойство("ТолькоНезаполненные") Тогда
		Элементы.ПоказатьТолькоНезаполненныеПоказатели.Пометка = Параметры.ТолькоНезаполненные;
		ВывестиТолькоПоказателиКЗаполнению();
	Иначе
		Элементы.ПоказатьТолькоНезаполненныеПоказатели.Пометка = Ложь;
	КонецЕсли;
	
	Если Параметры.Свойство("ТолькоЗначения") Тогда
		Элементы.ПоказатьТолькоНезаполненныеПоказатели.Видимость = Ложь;
		Элементы.ПоказателиКЗаполнению.Видимость = Ложь;
		Показатель = Параметры.Показатель;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЗначенияКЗаполнению, "Показатель", Показатель);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЗначенияКЗаполнению, "НачалоМесяца", НачалоМесяца(Период));
	
	СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	МесяцСтрока = ОбщегоНазначенияУТКлиент.ПолучитьПредставлениеПериодаРегистрации(Период);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПоказатьТолькоНезаполненныеПоказатели(Команда)
	Элементы.ПоказатьТолькоНезаполненныеПоказатели.Пометка = НЕ Элементы.ПоказатьТолькоНезаполненныеПоказатели.Пометка;
	Если Элементы.ПоказатьТолькоНезаполненныеПоказатели.Пометка Тогда
		ВывестиТолькоПоказателиКЗаполнению();
	Иначе
		ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(ПоказателиКЗаполнению, "Ссылка");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьТолькоНезаполненныеЗначения(Команда)
	Элементы.ЗначенияКЗаполнениюПоказатьТолькоНезаполненныеЗначения.Пометка = НЕ Элементы.ЗначенияКЗаполнениюПоказатьТолькоНезаполненныеЗначения.Пометка;
	Если Элементы.ЗначенияКЗаполнениюПоказатьТолькоНезаполненныеЗначения.Пометка Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ЗначенияКЗаполнению, "ЗначениеПоказателя",, ВидСравненияКомпоновкиДанных.НеЗаполнено);
	Иначе
		ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(ЗначенияКЗаполнению, "ЗначениеПоказателя");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьПереопределяемуюКоманду(Команда)
	СобытияФормКлиент.ВыполнитьПереопределяемуюКоманду(ЭтаФорма, Команда);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ПоказателиКЗаполнениюПриАктивизацииСтроки(Элемент)
	
	Показатель = Элемент.ТекущаяСтрока;
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЗначенияКЗаполнению, "Показатель", Показатель);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗначенияКЗаполнениюПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
	Если Элементы.ПоказателиКЗаполнению.ТекущиеДанные <> Неопределено Тогда
		ПараметрыФормы = Новый Структура("Показатель, Период", Элементы.ПоказателиКЗаполнению.ТекущиеДанные.Ссылка, Период);
		ОткрытьФорму("РегистрСведений.ЗначенияПоказателейДляРаспределенияРасходов.Форма.ФормаЗаписи", ПараметрыФормы, ЭтаФорма);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПериодРегулирование(Элемент, Направление, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Период = ДобавитьМесяц(Период, Направление);
	МесяцСтрока = ОбщегоНазначенияУТКлиент.ПолучитьПредставлениеПериодаРегистрации(Период);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЗначенияКЗаполнению, "НачалоМесяца", НачалоМесяца(Период));
КонецПроцедуры

&НаКлиенте
Процедура ЗначенияКЗаполнениюВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Данные = Элемент.ТекущиеДанные;
	ПараметрыФормы = Новый Структура("Показатель, Период, Подразделение, ЗначениеПоказателя",
			Показатель, Данные.Период, Данные.Подразделение, Данные.ЗначениеПоказателя);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбновитьСписокПоказателей", ЭтаФорма);
	
	ОткрытьФорму("РегистрСведений.ЗначенияПоказателейДляРаспределенияРасходов.Форма.ФормаЗаписи", ПараметрыФормы, ЭтаФорма,,,,ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписокПоказателей(Результат, ПараметрКоманды) Экспорт
	Элементы.ЗначенияКЗаполнению.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура ПериодНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Оповещение = Новый ОписаниеОповещения("МесяцСтрокаНачалоВыбораЗавершение", ЭтотОбъект);
	ОбщегоНазначенияУТКлиент.НачалоВыбораПредставленияПериодаРегистрации(Элемент, СтандартнаяОбработка, Период, ЭтаФорма, Оповещение);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыФункции 

Процедура ВывестиТолькоПоказателиКЗаполнению()
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	Показатели.Ссылка КАК Показатель
	|ИЗ
	|	Справочник.ПравилаРаспределенияРасходов КАК Показатели
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияПоказателейДляРаспределенияРасходов КАК ЗначенияЕжемесячно
	|		ПО Показатели.Ссылка = ЗначенияЕжемесячно.Показатель
	|			И (НАЧАЛОПЕРИОДА(ЗначенияЕжемесячно.Период, МЕСЯЦ) = &НачалоМесяца)
	|ГДЕ
	|	НЕ Показатели.ПометкаУдаления
	|	И ЗначенияЕжемесячно.Показатель ЕСТЬ NULL 
	|	И Показатели.БазаРаспределения = ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.ВводитсяЕжемесячно)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Показатели.Ссылка
	|ИЗ
	|	Справочник.ПравилаРаспределенияРасходов КАК Показатели
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияПоказателейДляРаспределенияРасходов.СрезПоследних(&КонецМесяца, ) КАК ЗначенияПриИзменении
	|		ПО Показатели.Ссылка = ЗначенияПриИзменении.Показатель
	|ГДЕ
	|	НЕ Показатели.ПометкаУдаления
	|	И ЗначенияПриИзменении.Показатель ЕСТЬ NULL 
	|	И Показатели.БазаРаспределения = ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.ВводитсяПриИзменении)");
	
	Запрос.УстановитьПараметр("НачалоМесяца", НачалоМесяца(Период));
	Запрос.УстановитьПараметр("КонецМесяца", КонецМесяца(Период));

	Результат = Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда
		НезаполненныеПоказатели = Результат.Выгрузить().ВыгрузитьКолонку("Показатель");
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ПоказателиКЗаполнению, "Ссылка", НезаполненныеПоказатели, ВидСравненияКомпоновкиДанных.ВСписке, ,Истина);
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ПоказателиКЗаполнению, "Ссылка", Справочники.ПравилаРаспределенияРасходов.ПустаяСсылка(), ВидСравненияКомпоновкиДанных.Равно, ,Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура МесяцСтрокаНачалоВыбораЗавершение(ВыбранныйПериод, ДополнительныеПараметры) Экспорт 
	Если ВыбранныйПериод <> Неопределено Тогда
		Период = ВыбранныйПериод;
		МесяцСтрока = ОбщегоНазначенияУТКлиент.ПолучитьПредставлениеПериодаРегистрации(ВыбранныйПериод);
	КонецЕсли;
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЗначенияКЗаполнению, "НачалоМесяца", НачалоМесяца(Период));
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ЗначенияКЗаполнениюЗначениеПоказателя.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ЗначенияКЗаполнению.ЗначениеПоказателя");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ТекстЗапрещеннойЯчейкиЦвет);
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru='<не указано>';uk='<не зазначено>'"));
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ЗначенияКЗаполнениюПериод.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ЗначенияКЗаполнению.ЗначениеПоказателя");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ТекстЗапрещеннойЯчейкиЦвет);
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru='<не задано>';uk='<не зазначено>'"));
	
КонецПроцедуры

#КонецОбласти
